const aboutMe = [
    {
        dataTitle: ' اول از همه، از معرفی خودم شروع میکنم:',
        dataIcon: 'fa-solid fa-user-secret',
        dataColor: 'rgb(250, 104, 0)',
        dataText: [
            'من همایون شریفی ام، تخصص اصلیم کدنویسی زبان جاوا اسکپریت و توسعه فرانت-اند با این زبان هست',
            'ولی مهارت های دیگه ای هم توی زمینه های مختلف دارم که پایین تر بهتون میگم ولی تاکید میکنم مهارت اصلیم JS هست',
            'در ادامه تمام مهارت هایی رو که در پایین میبینید من قادرم باهاشون پروژه های دانشجویی و معمولی رو انجام بدم و نمونه کارهایی هم دارم.'
        ]
    },
    {
        dataTitle: "با مهارت‌های کم‌استفاده یا خارج از حوزه تمرکزم شروع میکنم",
        dataIcon: "fa-sharp fa-solid fa-not-equal",
        dataColor: "#E53935",
        dataText: [
            "تمرکزم روی مهارت‌هایی بوده که واقعاً بهشون علاقه دارم و توشون عمیق شدم",
            "با بعضی ابزارها و حوزه‌ها آشنایی دارم، ولی مسیر تخصصی من چیز دیگه‌ای بوده",
            "البته من همیشه در حال یادگیری و افزودن مهارت ها و ابزارهای جدید به کارم هستم."
        ]
    },
    {
        dataTitle: " ساخت محتوای آموزشی با Articulate Storyline",
        dataIcon: "fa-solid fa-film",
        dataColor: "#00ABA9",
        dataText: [
            "هرچند علاقه‌ی اصلی‌ام جای دیگه‌ست، ولی تجربه‌ ای از کار با استوری لاین هم دارم",
            "با Storyline پروژه‌های آموزشی ساده طراحی کرده‌ام، مخصوصاً برای پروژه‌های دانشجویی",
            "البته یه سری نمونه کار دانشجویی هم ازش دارم که برای دانشجوها مناسب بودن و قابل قبول برای استادشون بود."
        ]
    },
    {
        dataTitle: "شبیه‌سازی دیجیتال با ModelSim",
        dataIcon: "fa-solid fa-gear",
        dataColor: "#9B59B6",
        dataText: [
            "تجربه‌ی کار با ModelSim در پروژه‌های ساده‌ی درسی و آزمایشگاهی رو دارم",
            "مفاهیم پایه‌ای مثل تست‌بنچ، موج‌فرم‌ها و شبیه‌سازی ماژول‌ها رو تا حدی در مدلسیم پیاده‌سازی کردم."
        ]
    },
    {
        dataTitle: "شبیه‌سازی شبکه با GNS3",
        dataIcon: "fa-solid fa-globe",
        dataColor: "#4C75A3",
        dataText: [
            'توپولوژی شبکه، اتصال به Router، Switch، Cloud، Virtual PC رو به‌صورت عملی تست کردم.',
            "با ابزار GNS3 چند پروژه‌ی شبیه‌سازی ساده انجام دادم، مخصوصاً در حوزه‌های آموزشی و دانشجویی"
        ]
    },
    {
        dataTitle: " طراحی دیاگرام و نقشه شبکه با Visio",
        dataIcon: "fa-solid fa-chart-simple",
        dataColor: "#DA552F",
        dataText: [
            "با Visio چندین دیاگرام شبکه (Network Diagram) و چارت‌های ساختاری طراحی کردم",
            "از ویزیو یا ویژیو بیشتر برای مستندسازی و ارائه‌های دانشجویی و فنی استفاده کردم که نمونه کار هم ازش دارم."
        ]
    },
    {
        dataTitle: "کار با Windows Server و VMware",
        dataIcon: "fa-brands fa-windows",
        dataColor: "#825A2C",
        dataText: [
            "هرچند تمرکز من بیشتر روی وب هست، اما درکی از مفاهیم پایه‌ی ویندوز سرور و مجازی‌سازی دارم",
            "با Windows Server در حد نصب، پیکربندی اولیه و مدیریت ساده‌ی کاربران و نقش‌ها آشنا هستم",
            "روی ماشین مجازی VMware چندین سیستم‌عامل نصب و تست کرده‌ام، مخصوصاً برای محیط‌های آزمایشی."
        ]
    },
    {
        dataTitle: " شبیه‌سازی و پیاده‌سازی پروژه با Proteus و Arduino",
        dataIcon: "fa-solid fa-plug",
        dataColor: "#D80073",
        dataText: [
            "آشنایی کامل با پروژه های دانشجویی و چند نمونه کار هم ازشون دارم",
            "تجربه‌ی طراحی و شبیه‌سازی انواع پروژه‌های الکترونیکی در Proteus برای دانشجویان",
            "برنامه‌نویسی Arduino و اتصال سنسورها، ماژول‌ها، و ساخت پروژه‌های کاربردی (Arduino Projects)"
        ]
    },
    {
        dataTitle: " برنامه‌نویسی با Python",
        dataIcon: "fa-brands fa-python",
        dataColor: "#00B489",
        dataText: [
            "مدتیه کمتر از پایتون استفاده می‌کنم، ولی هنوزم ساختار و منطقش برام کاملاً قابل درکه",
            "اولین زبانی که باهاش عمیق شدم و مفاهیم برنامه‌نویسی رو واقعی یاد گرفتم، Python بود",
            "و حتی ساخت شبکه خصوصی و راه اندازی VPN بصورت شبیه سازی هم در پایتون انجام دادم",
            "باهاش پروژه‌های مختلفی زدم، از اسکریپت‌نویسی گرفته تا تجربه‌هایی در automation و کارهای دانشگاهی."
        ]
    },
    {
        dataTitle: "طراحی سایت یا Web Design با WordPress",
        dataIcon: "fa-brands fa-wordpress",
        dataColor: "#21759B",
        dataText: [
            "از صفر تا صد سایت رو طراحی می‌کنم؛ بدون استفاده از قالب‌های آماده، با تمرکز روی نیاز واقعی کارفرما",
            "فعلاً در حال یادگیری عمیق‌تر هستم، اما همین حالا هم یک نمونه‌کار واقعی و کامل دارم که می‌تونید <a target=\"_blank\" href=\"https://pars-dashtestan-upvc.ir\" style=\"color: var(--footer__link); font-weight: 600\">اینجا</a> ببینید",
            "طراحی سایت‌های فروشگاهی، شخصی، شرکتی و معرفی خدمات رو با وردپرس انجام می‌دم — بدون کپی، با خلاقیت خودم",
            "با WordPress می‌تونم سایت‌هایی با طراحی خاص، رابط جذاب و تجربه بهینه بسازم. سایت‌هایی که از نظر سرعت با موبایل بهینه‌سازی شدن",
            "تمرکز من روی ساخت سایت وردپرسی از پایه و بدون قالب‌های تکراریه، اگر دنبال یه سایت شیک با قیمت مناسب هستید، خوشحال می‌شم باهاتون همکاری کنم.",

        ]
    },
    // {
    //     dataTitle: "",
    //     dataIcon: "",
    //     dataColor: "#",
    //     dataText: [
    //         "",
    //         "",
    //         ""
    //     ]
    // },
    // {
    //     dataTitle: "",
    //     dataIcon: "",
    //     dataColor: "#",
    //     dataText: [
    //         "",
    //         "",
    //         ""
    //     ]
    // },
    // {
    //     dataTitle: "",
    //     dataIcon: "",
    //     dataColor: "#",
    //     dataText: [
    //         "",
    //         "",
    //         ""
    //     ]
    // },
    // {
    //     dataTitle: "",
    //     dataIcon: "",
    //     dataColor: "#",
    //     dataText: [
    //         "",
    //         "",
    //         ""
    //     ]
    // },
]

export {aboutMe};
