const aboutMySkills = [
    {
        dataTitle: ' اول از همه، از معرفی خودم شروع میکنم:',
        dataIcon: 'fa-solid fa-user-secret',
        dataColor: 'rgb(250, 104, 0)',
        dataText: [
            'من همایون شریفی ام 24 سالمه، تخصص اصلیم کدنویسی زبان جاوا اسکپریت و توسعه فرانت-اند با این زبان هست',
            "ریشه علاقه من در سن 8 سالگی از سال 88 در بلاگفا با اینترنت لاکپشتی، گوشی Xperia Neo L و وبلاگ ساختن شروع شد",
            'من مهارت های دیگه ای هم توی زمینه های مختلف دارم که پایین تر بهتون میگم ولی تاکید میکنم مهارت اصلیم JS هست',
            'در ادامه تمام مهارت هایی رو که در پایین میبینید من قادرم باهاشون پروژه های دانشجویی و معمولی رو انجام بدم و نمونه کارهایی هم دارم.'
        ]
    },
    {
        dataTitle: "چنل یوتیوب آموزشیِ فرانت اند",
        dataIcon: 'fa-brands fa-youtube',
        dataColor: 'rgb(250, 104, 0)',
        dataText: [
            "در اوایل ورودم به فرانت اند مشکلات زیادی داشتم و برای حل این مشکلات، منبع فارسی خیلی خوبی وجود نداشت",
            "بخاطر همین تصیمیم گرفتم که یک <a href=\"https://www.youtube.com/@homow_dev\" target=\"_blank\" style=\"color:var(--footer__link); font-weight: 600\">چنل یوتیوب</a> برای همون مشکلات با کیفیت تصویر و صدای مناسب راه اندازی کنم، مخصوص فرانت اند",
            "پس اگر تازه وارد فرانت شدید یا حتی قصد دارید که با مهارت های فرانت اندتون کاربردی تر ادامه بدید این <a href=\"https://www.youtube.com/@homow_dev\" target=\"_blank\" style=\"color:var(--footer__link); font-weight: 600\">چنل یوتیوب</a> مخصوص شماست، کنار هم میتونیم پیشرفت کنیم."
        ]
    },
    {
        dataTitle: "با مهارت‌های کم‌استفاده یا خارج از حوزه تمرکزم شروع میکنم",
        dataIcon: "fa-sharp fa-solid fa-not-equal",
        dataColor: "#E53935",
        dataText: [
            "تمرکزم روی مهارت‌هایی بوده که واقعاً بهشون علاقه دارم و توشون عمیق شدم",
            "با بعضی ابزارها و حوزه‌ها آشنایی دارم، ولی مسیر تخصصی من چیز دیگه‌ای بوده",
            "البته من همیشه در حال یادگیری و افزودن مهارت ها و ابزارهای جدید به کارم هستم."
        ]
    },
    {
        dataTitle: " ساخت محتوای آموزشی با Articulate Storyline",
        dataIcon: "fa-solid fa-film",
        dataColor: "#00ABA9",
        dataText: [
            "هرچند علاقه‌ی اصلی‌ام جای دیگه‌ست، ولی تجربه‌ ای از کار با استوری لاین هم دارم",
            "با Storyline پروژه‌های آموزشی ساده طراحی کرده‌ام، مخصوصاً برای پروژه‌های دانشجویی",
            "البته یه سری نمونه کار دانشجویی هم ازش دارم که برای دانشجوها مناسب بودن و قابل قبول برای استادشون بود."
        ]
    },
    {
        dataTitle: "شبیه‌سازی دیجیتال با ModelSim",
        dataIcon: "fa-solid fa-gear",
        dataColor: "#9B59B6",
        dataText: [
            "تجربه‌ی کار با ModelSim در پروژه‌های ساده‌ی درسی و دانشجویی رو دارم",
            "مفاهیم پایه‌ای مثل تست‌بنچ، موج‌فرم‌ها و شبیه‌سازی ماژول‌ها رو تا حدی در مدلسیم پیاده‌سازی کردم."
        ]
    },
    {
        dataTitle: "شبیه‌سازی شبکه با GNS3",
        dataIcon: "fa-solid fa-globe",
        dataColor: "#4C75A3",
        dataText: [
            'توپولوژی شبکه، اتصال به Router، Switch، Cloud، Virtual PC رو به‌صورت شبیه سازی تست کردم',
            "با ابزار GNS3 چند پروژه‌ی شبیه‌سازی ساده انجام دادم، مخصوصاً در حوزه‌های آموزشی و دانشجویی."
        ]
    },
    {
        dataTitle: " طراحی دیاگرام و نقشه شبکه با Visio",
        dataIcon: "fa-solid fa-chart-simple",
        dataColor: "#DA552F",
        dataText: [
            "با Visio چندین دیاگرام شبکه (Network Diagram) و چارت‌های ساختاری طراحی کردم",
            "از ویزیو یا ویژیو بیشتر برای مستندسازی و ارائه‌های دانشجویی و فنی استفاده کردم که نمونه کار هم ازش دارم."
        ]
    },
    {
        dataTitle: "کار با Windows Server و VMware",
        dataIcon: "fa-brands fa-windows",
        dataColor: "#825A2C",
        dataText: [
            "هرچند تمرکز من بیشتر روی وب هست، اما درکی از مفاهیم پایه‌ی ویندوز سرور و مجازی‌سازی دارم",
            "با Windows Server در حد نصب، پیکربندی اولیه و مدیریت ساده‌ی کاربران و نقش‌ها آشنا هستم",
            "روی ماشین مجازی VMware چندین سیستم‌عامل نصب و تست کرده‌ام، مخصوصاً برای محیط‌های آزمایشی."
        ]
    },
    {
        dataTitle: " شبیه‌سازی و پیاده‌سازی پروژه با Proteus و Arduino",
        dataIcon: "fa-solid fa-plug",
        dataColor: "#D80073",
        dataText: [
            "آشنایی کامل با پروژه های دانشجویی و چند نمونه کار هم ازشون دارم",
            "تجربه‌ی طراحی و شبیه‌سازی انواع پروژه‌های الکترونیکی در Proteus برای دانشجویان",
            "برنامه‌نویسی Arduino و اتصال سنسورها، ماژول‌ها، و ساخت پروژه‌های کاربردی (Arduino Projects)"
        ]
    },
    {
        dataTitle: "توسعه اپلیکیشن‌های دسکتاپ با C# و WPF",
        dataIcon: "fa-solid fa-hashtag",
        dataColor: "#B13BFF",
        dataText: [
            "انجام پروژه‌های سبک و دانشجویی با طراحی شیک و تجربه کاربری خوب در Visual Studio",
            " تمرکز روی نیاز پروژه‌های دانشجویی، ساده، قابل فهم و مستند برای ارائه در ویژوال استودیو",
            "ساخت اپ‌های فرم‌محور با ظاهر مدرن، استفاده از WPF برای طراحی رابط کاربری مرتب و کاربرپسند",
        ]
    },
    {
        dataTitle: " برنامه‌نویسی با Python",
        dataIcon: "fa-brands fa-python",
        dataColor: "#00B489",
        dataText: [
            "مدتیه کمتر از پایتون استفاده می‌کنم، ولی هنوزم ساختار و منطقش برام کاملاً قابل درکه",
            "اولین زبانی که باهاش عمیق شدم و مفاهیم برنامه‌نویسی رو واقعی یاد گرفتم، Python بود",
            "و حتی ساخت شبکه خصوصی و راه اندازی VPN بصورت شبیه سازی هم در پایتون انجام دادم",
            "باهاش پروژه های مختلفی زدم، از اسکریپت نویسی گرفته تا تجربه هایی در translate بصورت  exe و پروژه های دانشجویی"
        ]
    },
    {
        dataTitle: "طراحی سایت یا Web Design با WordPress",
        dataIcon: "fa-brands fa-wordpress",
        dataColor: "#21759B",
        dataText: [
            "از صفر تا صد سایت رو طراحی می‌کنم؛ بدون استفاده از قالب‌های آماده، با تمرکز روی نیاز واقعی کارفرما",
            "فعلاً در حال یادگیری عمیق‌تر هستم، اما همین حالا هم یک نمونه‌کار واقعی و کامل دارم که می‌تونید <a target=\"_blank\" href=\"https://pars-dashtestan-upvc.ir\" style=\"color: var(--footer__link); font-weight: 600\">اینجا</a> ببینید",
            "طراحی سایت‌های فروشگاهی، شخصی، شرکتی و معرفی خدمات رو با وردپرس انجام می‌دم — بدون کپی، با خلاقیت خودم",
            "با WordPress می‌تونم سایت‌هایی با طراحی خاص، رابط جذاب و تجربه بهینه بسازم. سایت‌هایی که از نظر سرعت با موبایل بهینه‌سازی شدن",
            "تمرکز من روی ساخت سایت وردپرسی از پایه و بدون قالب‌های تکراریه، اگر دنبال یه سایت شیک با قیمت مناسب هستید، خوشحال می‌شم باهاتون همکاری کنم.",

        ]
    },
    {
        dataTitle: "توسعه فرانت‌اند با HTML, CSS & JavaScript",
        dataIcon: "fa-brands fa-square-js",
        dataColor: "rgb(216, 140, 24)",
        dataText: [
            "توسعه مدرن فرانت‌اند و مدیریت پروژه با Git (گیت) و GitHub (گیت‌هاب)",
            "بهینه‌سازی عملکرد، خوانایی کد، و رعایت کامل اصول SEO در HTML و ساختار وب",
            "طراحی و پیاده‌سازی Dark/Light Mode با کنترل دقیق حالت‌های کاربر و ذخیره‌سازی لوکال",
            "ساخت رابط‌های کاربری مدرن و تعاملی با Vanilla JavaScript، بدون وابستگی به کتابخانه‌ها",
            "تسلط کامل بر مفاهیم Responsive Design، طراحی ریسپانسیو برای موبایل، تبلت و دسکتاپ و..",
            "استفاده از تکنیک‌های پیشرفته مثل Shadow DOM، طراحی کامپوننتی و ساختار ماژولار در پروژه‌ها",
            "طراحی کامل و اختصاصی وب‌سایت، مثل <a target='_blank' style='font-weight: 600; color: color: var(--footer__link);'  href='https://homow.ir'>homow.ir</a> با استفاده از HTML، CSS و JavaScript — بدون هیچ فریم‌ورک آماده",
            "کدنویسی طرح های رابط کاربری و تجربه کاربری (UI/UX) در ابزارهایی مانند Figma، هم برای وب‌سایت‌های چندصفحه‌ای و هم Landing Page تک‌صفحه‌ای",
            "البته من در حال یادگیری React (ری‌اکت) هستم و بعد از اون سراغ بک‌اند هم میرم. هدفم اینه که همیشه در حال توسعه‌ی مهارت‌های برنامه‌نویسی خودم باشم."
        ]
    },
    {
        dataTitle: "توسعه‌ سایت Portfolio اختصاصی مثل همین وبسایت",
        dataIcon: "fa-solid fa-address-card",
        dataColor: "rgb(244, 114, 208)",
        dataText: [
            "این نوع سایت‌های portfolio فقط با Git و GitHub مدیریت می‌شن و هیچ نیازی به هاست یا سرویس میزبانی ندارن",
            "این سایت‌ها فقط با یه دامنه‌ی اختصاصی .ir (با هزینه‌ای بسیار پایین) راه‌اندازی می‌شن و هیچ هزینه اضافی برای هاست یا افزونه ندارن",
            "کل فرایند طراحی، پیاده‌سازی، سئو و ریسپانسیو با مهارت من انجام می‌شه و شما فقط هزینه طراحی سایت رو پرداخت می‌کنید — نه بیشتر",
            "می‌تونم براتون یه وب‌سایت شخصی یا پورتفولیو درست مثل <a target=\"_blank\" href=\"https://homow.ir\" style=\"color: var(--footer__link); font-weight: 600\">homow</a> بسازم: شیک، سریع، واکنش‌گرا، بدون قالب آماده و کاملاً منحصربه‌فرد."
        ]
    },
    {
        dataTitle: "آماده سازی فایل ها و تحویل برای تمام پروژه ها",
        dataIcon: "fa-solid fa-file-invoice",
        dataColor: "rgb(190, 91, 80)",
        dataText: [
            "ارائه راهنماهای تصویری و ویدئویی در صورت نیاز، با پاسخ‌گویی سریع تا مرحله نهایی پروژه",
            "تحویل کامل فایل‌ها و گزارش‌ها همراه با آموزش دقیق برای راه‌اندازی سریع و بدون سردرگمی",
            "پشتیبانی تا مدتی بعداز تحویل پروژه و رفع مشکلات(زمان پشتیبانی بسته به نوع و حجم پروژه)"
        ]
    },
    {
        dataTitle: " تماس سریع - روی شماره کلیک کنید",
        dataIcon: "fa-solid fa-square-phone",
        dataColor: "rgb(52, 116, 51)",
        dataText: [
            '<a style="text-decoration: none !important; color: var(--footer__link);" dir="ltr" href="tel:+989036364078" title="تماس شماره ۱">+98 903 636 4078</a>',
            '<a style="text-decoration: none !important; color: var(--footer__link);" dir="ltr" href="tel:+989210629512" title="تماس شماره ۲">+98 921 062 9512</a>'
        ]
    },
]

export {aboutMySkills};
